src/bankid/client-create-bankid-3.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
   <!--soapenv:Header>
      <tem:AuthSoapHeader>
        <tem:Login>istest</tem:Login>
         <tem:Password>gfhjk</tem:Password>
      </tem:AuthSoapHeader>
   </soapenv:Header-->
   <soapenv:Header>
      <tem:AuthSoapHeader>
        <tem:Login>UKRGAS\appmb</tem:Login>
         <tem:Password>$N$q3:ynw=B)_OM}</tem:Password>
      </tem:AuthSoapHeader>
   </soapenv:Header>
   
   <soapenv:Body>
      <tem:CreateClientFL>
         <tem:client>
            <tem:Request>
               <tem:RequestId>12547</tem:RequestId>
               <tem:UserLogin>UKRGAS\appmb</tem:UserLogin>
            </tem:Request>
            <!--tem:ClientId>1747753</tem:ClientId-->
            <tem:SendToScrooge>1</tem:SendToScrooge>
            <tem:Clients>
               <tem:StateCode>3255214997</tem:StateCode>
               <tem:Residency>1</tem:Residency>
               <tem:Name>Рабушенко Антон Володимирович</tem:Name>               
               <tem:Type>1</tem:Type>
               <tem:SubType>0</tem:SubType>
               <tem:isTechFlag>0</tem:isTechFlag>
               <tem:IsOut>0</tem:IsOut>
               <tem:IsPotential>0</tem:IsPotential>
               <tem:IsPartner>false</tem:IsPartner>
               <tem:PrevIdentDate>2021-01-16T00:00:00</tem:PrevIdentDate>
               <tem:Status>1</tem:Status>
            </tem:Clients>            
            <tem:Individuals>
               <tem:FirstName>Антон</tem:FirstName>
               <tem:LastName>Рабушенко</tem:LastName>
               <tem:FatherName>Володимирович</tem:FatherName>
               <tem:Gender>1</tem:Gender>
               <tem:BirthDay>1991-12-15T00:00:00</tem:BirthDay>
               <tem:BirthSurname></tem:BirthSurname>
               <!--tem:MarriageStatus></tem:MarriageStatus-->
               <tem:MarriageStatus>6</tem:MarriageStatus>
               <tem:Status>1</tem:Status>
            </tem:Individuals>            
            <tem:ClientNames>                                        
              <tem:TNames>
                  <tem:Lang>LAT</tem:Lang>
                  <tem:Name>Kateryna Ivanova</tem:Name>
                  <tem:FullName>Kateryna Ivanova</tem:FullName>
                  <tem:FullNameR/>
                  <tem:FullNameD/>
                  <tem:Status>1</tem:Status>                 
              </tem:TNames>                          
            </tem:ClientNames>                                        
            <tem:Identifications>
               <tem:TIdentifications>
                  <tem:TypeId>4</tem:TypeId>
                  <tem:Series>НВ</tem:Series>
                  <tem:Number>498823</tem:Number>
                  <tem:Registrator>Шепетівським МВ УМВС України в Хмельницькій област</tem:Registrator>
                  <tem:IssueDate>2008-07-24T00:00:00</tem:IssueDate>
                  <tem:ExpirationDate>2099-01-01T00:00:00</tem:ExpirationDate>
                  <tem:IsMain>true</tem:IsMain>
                  <tem:Checked>true</tem:Checked>
                  <tem:Status>1</tem:Status>
               </tem:TIdentifications>
            </tem:Identifications>            
            <tem:Addresses>               
               <tem:TAddresses>
                  <tem:TypeId>2</tem:TypeId>
                  <tem:TypeCode>2</tem:TypeCode>
                  <tem:Country>804</tem:Country>
                  <!--tem:PostalCode>14017</tem:PostalCode-->
                  <tem:State>Київська</tem:State>
                  <tem:Region/>
                  <tem:TownshipType>3508</tem:TownshipType>
                  <tem:Town>Буча</tem:Town>
                  <tem:StreetType>3510</tem:StreetType>
                  <tem:Street>Шухевича Романа</tem:Street>
                  <tem:HouseType>3511</tem:HouseType>
                  <tem:HouseNumber>1Г</tem:HouseNumber>
                  <tem:FlatType>3506</tem:FlatType>
                  <tem:FlatNumber></tem:FlatNumber>
                  <tem:LandlinePhoneNumber/>
                  <tem:PropertyStatus/>
                  <tem:Status>1</tem:Status>
               </tem:TAddresses>               
               <tem:TAddresses>
                  <tem:TypeId>1</tem:TypeId>
                  <tem:TypeCode>1</tem:TypeCode>
                  <tem:Country>804</tem:Country>
                  <!--tem:PostalCode>14017</tem:PostalCode-->
                  <tem:State>Київська</tem:State>
                  <tem:Region/>
                  <tem:TownshipType>3508</tem:TownshipType>
                  <tem:Town>Буча</tem:Town>
                  <tem:StreetType>3510</tem:StreetType>
                  <tem:Street>Шухевича Романа</tem:Street>
                  <tem:HouseType>3511</tem:HouseType>
                  <tem:HouseNumber>1Г</tem:HouseNumber>
                  <tem:FlatType>3506</tem:FlatType>
                  <tem:FlatNumber></tem:FlatNumber>
                  <tem:LandlinePhoneNumber/>
                  <tem:PropertyStatus/>
                  <tem:Status>1</tem:Status>
               </tem:TAddresses>            
            </tem:Addresses>
            <tem:Communications>
               <tem:TCommunications>
                  <tem:TypeId>3</tem:TypeId>
                  <tem:TypeCode>3</tem:TypeCode>
                  <tem:Value>380671112223</tem:Value>
                  <tem:IsMain>true</tem:IsMain>
                  <tem:IsVerified>true</tem:IsVerified>
                  <tem:Note/>
                  <tem:SourceInfo/>
                  <tem:Status>1</tem:Status>
               </tem:TCommunications>
            </tem:Communications>            
            <tem:Properties>
                <tem:TProperties>
                  <tem:Code>GENDER</tem:Code>
                  <tem:Value>1</tem:Value>
                </tem:TProperties>
                <tem:TProperties>
                  <tem:Code>CL_FATF_CHECK_RESULT</tem:Code>
                  <tem:Value>Клиент НЕ являестя террористом соглано данных bankid</tem:Value>
                </tem:TProperties>
                <tem:TProperties>
                  <tem:Code>PUBLIC_PERSON_EXISTS</tem:Code>
                  <tem:Value>1</tem:Value>
                </tem:TProperties>
                <tem:TProperties>
                  <tem:Code>FATF_SHORT_NAME</tem:Code>
                  <tem:Value>Kateryna Ivanova</tem:Value>
                </tem:TProperties>
                <tem:TProperties>
                  <tem:Code>Verifikatsii_date </tem:Code>
                  <tem:Value>16.01.2021</tem:Value>
                </tem:TProperties>
            </tem:Properties>         
         </tem:client>
      </tem:CreateClientFL>
   </soapenv:Body>
</soapenv:Envelope>